tap "adoptopenjdk/openjdk"
tap "boz/repo"
tap "datawire/blackbird"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "knqyf263/pet"
tap "norwoodj/tap"
tap "warrensbox/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli", link: false
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Test your configuration files using Open Policy Agent
brew "conftest"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Kubernetes command-line interface
brew "kubernetes-cli"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# .NET Core
brew "dotnet"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Platform built on V8 to build network applications
brew "node"
# Command-line JSON processing tool
brew "fx"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU grep, egrep and fgrep
brew "grep"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Cost estimates for Terraform
brew "infracost"
# Read your tfstate or HCL to generate a graph
brew "inframap"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes YAML to Terraform HCL converter
brew "k2tf"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "kubeval"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# Manage multiple Node.js versions
brew "nvm"
# Open source, general-purpose policy engine
brew "opa"
# Display the PID number for a given process name
brew "pidof"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Soak up standard input and write to a file
brew "sponge"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Tool providing extra functionality for Terraform
brew "terrahelp"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Access X11 clipboards from the command-line
brew "xclip"
# Process YAML documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# Local dev environment attached to a remote Kubernetes cluster
brew "datawire/blackbird/telepresence"
# Vault
brew "hashicorp/tap/vault"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk14"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
cask "background-music"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Development environment
cask "vagrant"
mas "CleanMyDrive 2", id: 523620159
mas "Clipboard Guru - History and Snippet manager", id: 804607288
mas "Dropshelf", id: 540404405
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Quick View Calendar", id: 1087080039
mas "Quiver", id: 866773894
mas "Skitch", id: 425955336
mas "TickTick", id: 966085870
mas "TinyStopwatch", id: 1447754003
mas "XMenu", id: 419332741
